import sqlite3
dbname = 'genshin.db'
conn = sqlite3.connect(dbname)
cur = conn.cursor()
artifactlist = ["氷風を彷徨う勇士", "雷を鎮める尊者", "烈火を渡る賢者", "愛される少女", "剣闘士のﾌｨﾅｰﾚ", "翠緑の影","大地を流浪する楽団", "雷のような怒り", "燃え盛る炎の魔女", "旧貴族のしつけ", "血染めの騎士道", "悠久の磐岩","逆飛びの流星", "沈淪の心", "千岩牢固", "蒼白の炎", "追憶のしめ縄", "絶縁の旗印","華館夢醒形骸記", "海染硨磲", "辰砂往生録", "来歆の余響", "深林の記憶", "金ﾒｯｷの夢","砂上の楼閣の史話", "楽園の絶花", "水仙の夢", "花海甘露の光", "ﾌｧﾝﾄﾑﾊﾝﾀｰ", "黄金の劇団","残響の森で囁かれる夜話", "在りし日の歌", "諧律奇想の断章", "遂げられなかった想い", "灰燼の都に立つ英雄の絵巻", "黒曜の秘典","深廊の終曲", "長き夜の誓い", "", "", "", "","旅人の心", "奇跡", "狂戦士", "教官", "亡命者", "守護の心","勇士の心", "武人", "博徒", "学者", "○祭りの人"]
for i in artifactlist:
    cur.execute("INSERT INTO ArtifactList(setname) values(" + artifactlist[i] + ")")
conn.commit()
cur.close()
conn.close()
